public class Dev_5 {





    public static void main(String[] args) {

        String word = ""+
        "2.객체지향속성"+
        "(1)캡슐화: 객체의 속성과 행위를 하나로 묶고 실제 구현 내용과 일부를 외부에 감추어 은닉하는 기법"+
        "(2)추상화: 어떤실체로 부터 공통적인 부분이나 관심 있는 부분을 하나로 모은 것 공통적인 메서드를 인터페이스로 정의"+
        "(3)다형성: 같은 모양의 함수가 상황에 따라 다르게 동작"+
        "(ㄱ)오버로딩 : 이름은 같으나 매개변수 숫자 타입을 다르게 사용"+
        "(ㄴ)오버라이딩 : 상위 클래스 매서드를 하위 클래스가 재정의 "+
        "(4)정보은닉: 캡슐화 정보들을 밖에서 접근이 불가능하게 하는 것 프로퍼티와 메서드가 하나의 캡슐안에 묶임"+
        "(5)상속성: 부모클래스에 새로운 기능을 추가해서 자식클래스를 만들어 사용하는 기법"+


        "3.객체지향 설계원칙"+
        "1)단일책임원칙 => 모든 클래스는 각각 하나의 책임만 가져야한다"+
        "2)개방폐쇄원칙 =>"+
        "close: 확장에는 열려있고 수정에는 닫혀있어 기존의 코드를 변경하지 않고 "+
        "open: 기능은 추가할수있도록 설계가 되어야 한다는 원칙"+
        "3)리스코프치환원칙 : 자식 클래스는 자신의 부모 클래스를 대체 한다는 원칙"+
        "4)인터페이스 분리원칙: 한 클래스 자신이 사용하지 않는 인터페이스는 구현하지말아야한다는 원칙"+
        "5)의존성 역전의 법칙: 변화가 없는것에 의존해야 한다는 원칙"+
        "구체적인 클래스보다 인터페이스나 추상클래스와 관계를 맺어야 한다는 원칙"+
                
        "Unified Modeling Language "+
        "1) 유스케이스 다이어그램"+
        "1-1)액터"+
        "1-2) 유스케이스"+
        "1-3) 시스템"+
        "2) 클래스다이그램"+
        "2-1) 클래스"+
        "2-2)관계"+


        "(Bridge) 패턴은 기능의 클래스계층과 구현의 클래스 계층을 연결"+
        "(Observer)패턴은 한 객체의 상태가 바뀌면 그 객체에 의존"+
        "(살충제 패러독스)동일한 테스트 반복적 테스트는 새로운 버그를 찾지못한다"+
        "(데이터 마이닝) 대규모로 저장된 데이터안에서 체계적이고 자동적으로 통계적 규칙이나 패턴을 찾아내는 기술"
                
        
        
        
        
        ;
    }
    
    
    
    
}

